Ove88/kw41z-rf-driver/source/PhyPacketProcessor.c
  }

  return PanBitMask;
}

/*! *********************************************************************************
* \brief  Get the indirect queue level at which the HW queue will be split between PANs
*
* \return  uint8_t level
*
********************************************************************************** */
uint8_t PhyPpGetDualPanSamLvl(void)
{
    return (ZLL->SAM_CTRL & ZLL_SAM_CTRL_SAP1_START_MASK) >> ZLL_SAM_CTRL_SAP1_START_SHIFT;
}

/*! *********************************************************************************
* \brief  Set the indirect queue level at which the HW queue will be split between PANs
*
* \param[in]  level
*
********************************************************************************** */
void PhyPpSetDualPanSamLvl( uint8_t level )
{
    ZLL->SAM_CTRL &= ~ZLL_SAM_CTRL_SAA1_START_MASK;
    ZLL->SAM_CTRL |= ZLL_SAM_CTRL_SAP1_START(level);

    if( level )
    {
        ZLL->SAM_CTRL |= ZLL_SAM_CTRL_SAP1_EN_MASK;
    }
    else
    {
        ZLL->SAM_CTRL &= ~ZLL_SAM_CTRL_SAP1_EN_MASK;
    }
}

/*! *********************************************************************************
* \brief  This function compute the hash code for an 802.15.4 device
*
* \param[in]  pAddr     Pointer to an 802.15.4 address
* \param[in]  addrMode  The 802.15.4 addressing mode
* \param[in]  PanId     The 802.15.2 PAN Id
*
* \return  hash code
*
********************************************************************************** */
uint16_t PhyGetChecksum(uint8_t *pAddr, uint8_t addrMode, uint16_t PanId)
{
    uint16_t checksum;
    
    /* Short address */
    checksum  = PanId;
    checksum += *pAddr++;
    checksum += (uint16_t)((uint16_t)(*pAddr++) << 8);
    
    if( addrMode == 3 )    
    {
        /* Extended address */
        checksum += *pAddr++;
        checksum += (uint16_t)((uint16_t)(*pAddr++) << 8);
        checksum += *pAddr++;
        checksum += (uint16_t)((uint16_t)(*pAddr++) << 8);
        checksum += *pAddr++;
        checksum += (uint16_t)((uint16_t)(*pAddr++) << 8);
    }

    return checksum;
}

/*! *********************************************************************************
* \brief  This function adds an 802.15.4 device to the neighbor table.
*         If a polling device is not in the neighbor table, the ACK will have FP=1
*
* \param[in]  pAddr     Pointer to an 802.15.4 address
* \param[in]  addrMode  The 802.15.4 addressing mode
* \param[in]  PanId     The 802.15.2 PAN Id
*
********************************************************************************** */
uint8_t PhyAddToNeighborTable(uint8_t *pAddr, uint8_t addrMode, uint16_t PanId)
{
    return 1;
}

/*! *********************************************************************************
* \brief  This function removes an 802.15.4 device to the neighbor table.
*         If a polling device is not in the neighbor table, the ACK will have FP=1
*
* \param[in]  pAddr     Pointer to an 802.15.4 address
* \param[in]  addrMode  The 802.15.4 addressing mode
* \param[in]  PanId     The 802.15.2 PAN Id
*
********************************************************************************** */
uint8_t PhyRemoveFromNeighborTable(uint8_t *pAddr, uint8_t addrMode, uint16_t PanId)
{
    return 1;
}

/*! *********************************************************************************
* \brief  This function checks if an 802.15.4 device is in the neighbor table.
*         If a polling device is not in the neighbor table, the ACK will have FP=1
*
* \param[in]  checksum     hash code generated by PhyGetChecksum()
*
* \return  TRUE if the device is present in the neighbor table, FALSE if not.
*
********************************************************************************** */
bool_t PhyCheckNeighborTable(uint16_t checksum)
{
    return FALSE;
}

/*! *********************************************************************************
* \brief  Change the XCVR DSM duration
*
* \param[in]  duration  the new XCVR sleep duration
*
********************************************************************************** */
void PhyPlmeSetDSMDuration(uint32_t duration)
{
    /* Minimum DSM duration */
    mPhyDSMDuration = RSIM->DSM_OSC_OFFSET + mPhyDSM_GuardTime_d;
    
    if( duration > mPhyDSMDuration )
    {
        mPhyDSMDuration = duration;
    }
}

/*! *********************************************************************************
* \brief  Change the XCVR power state
*
* \param[in]  state  the new XCVR power state
*
* \return  phyStatus_t
*
********************************************************************************** */
phyStatus_t PhyPlmeSetPwrState( uint8_t state )
{
    phyStatus_t status = gPhySuccess_c;
    static uint8_t mPhyPwrState = gPhyPwrIdle_c;

    /* Parameter validation */
    if( state > gPhyPwrReset_c )
    {
        status = gPhyInvalidParameter_c;
    }
    /* Check if the new power state = old power state */
    else if( state == mPhyPwrState )
    {
        status = gPhyBusy_c;
    }
    else
    {
        switch(state)
        {
        case gPhyPwrIdle_c:
            /* Set XCVR in run mode if not allready */
            if(RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_ZIG_DEEP_SLEEP_STATUS_MASK)
            {
                RSIM->ZIG_WAKE = (RSIM->DSM_TIMER + mPhyDSM_GuardTime_d);
                while(RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_ZIG_DEEP_SLEEP_STATUS_MASK);
            }
            break;

        case gPhyPwrDSM_c:
            /* Set XCVR in low power mode if not allready */
            if(!(RSIM->DSM_CONTROL & RSIM_DSM_CONTROL_ZIG_DEEP_SLEEP_STATUS_MASK))
            {
                uint32_t minTime = (RSIM->DSM_OSC_OFFSET > mPhyDSM_GuardTime_d) ? RSIM->DSM_OSC_OFFSET : mPhyDSM_GuardTime_d;

                RSIM->ZIG_SLEEP = RSIM->DSM_TIMER + minTime;
                RSIM->ZIG_WAKE = RSIM->DSM_TIMER + mPhyDSMDuration;
                RSIM->DSM_CONTROL |= RSIM_DSM_CONTROL_ZIG_SYSCLK_REQUEST_EN_MASK |
                                     RSIM_DSM_CONTROL_DSM_TIMER_EN_MASK | 
                                     RSIM_DSM_CONTROL_ZIG_SYSCLK_INTERRUPT_EN_MASK;
            }
            break;

        default:
            status = gPhyInvalidPrimitive_c;
            /* do not change current state */
            state = mPhyPwrState;
            break;
        }
        
        mPhyPwrState = state;
    }
    
    return status;
}